Revit 2027 API
Schema.GUID Property
 The identifier of the Schema. Setter made unavailable, because it would violate set-correctness
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GUID { get; }
Public ReadOnly Property GUID As Guid
	Get
public:
property Guid GUID {
	Guid get ();
}
member GUID : Guid with get
Property Value
Guid
See Also
Reference
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace